/* 

বেসিক কনসেপ্ট চেকলিস্ট/সেলফ এসেসমেন্ট: 

একটা কাগজ কলম নিয়ে বসো। নিচের প্রশ্নগুলোর উত্তর যদি হাঁ হয় তাহলে ১ লিখবে আর যদি না হয় তাহলে শূন্য লিখবে। এবং জিনিসগুলো ভিজুয়াল ষ্টুডিও কোড এ প্রাকটিস করবে। কোন একটা জিনিস নিজে নিজে করতে পারলে অবশ্যই ভালো। আর কোন একটা জিনিস নিজে নিজে না পারলে, আমাদের ভিডিও না দেখে যদি গুগলে সার্চ দিয়ে বের করে হলেও যদি করে ফেলতে পারো তাহলেও চলবে। 

*/

/*

১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো। 

*/

const myString = "Farhan";
const myAge = 21;
const isPassed = false;

/*

২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে। 

*/

const fixed = 25;
let notFixed = 5;
notFixed = 10;

/*

৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, %এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একই ভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো। 

*/

const num = 5;
const kam = 2;

const add = num + kam;
const sub = num - kam;
const sum = num * kam;
const division = num / kam;
const modula = num % kam;

/*

৪. তুমি কি দুইটা ভেরিয়েবল এর মধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথম টা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো। 

*/

const one = 5;
const two = 6;

if (one > two) {
  console.log("one is large");
}
if (one < two) {
  console.log("two is large");
}
if (one == two) {
  console.log("both are same");
}
if (one != two) {
  console.log("they are not same");
}
if (one >= two) {
  console.log("two is large or equal");
}
if (one <= two) {
  console.log("one is large or equal");
}

/*

৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একই ভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো। 
*/

const job = true;
const house = false;

if (job == true && house == true) {
  console.log("shadi kor ga");
}

if (job == true || house == true) {
  console.log("ok continue");
}

/*

৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো 

*/

const mark = 56;

if (mark > 33) {
  console.log("pass");
} else {
  console.log("fail");
}

/*

৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো। 

না পারলে এই ভিডিও দেখো: 17_5-3 More while loops, odd numbers, even numbers

*/

let num1 = 7;

while (num1 <= 19) {
  if (num1 % 2 == 1) {
    console.log(num1);
  }
  num1++;
}

/*

৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে। 

*/

const myArray = [1, 9, 7, 6, 8, 3];

console.log("Length", myArray.length);
myArray[3] = 9;
console.log("change 3 number index", myArray);
myArray.push(2);
console.log("Add element last", myArray);
myArray.unshift(4);
console.log("add element first", myArray);
myArray.pop();
console.log("delete from last", myArray);
myArray.shift();
console.log("delete from first", myArray);

/*

৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো। 

*/

const array = [1, 2, 3, 4, 5, 6, 7, 8, 9];

for (let i = 0; i <= array.length; i++) {
  console.log("for loop", i);
}

for (const element of array) {
  console.log("for off loop", element);
}

/*

১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো 

*/

const myNumberArray = [20, 30, 80, 54, 98, 996, 369, 159, 20, 58, 97];

let eighty = [];
for (const element of myNumberArray) {
  if (element > 80) {
    eighty.push(element);
  }
}

console.log("bigger then 80: ", eighty);

/*

১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউট পুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো। 

*/

function sumThreeNumber(num1, num2, num3) {
  return num1 * num2 * num3;
}

console.log(sumThreeNumber(20, 30, 2));

/*

১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা। 

*/

const myLaptop = {
  name: "Samsung np270e5e",
  ram: "4 GB",
  ssd: false,
};

myLaptop.ssd = true;

console.log(myLaptop);
